Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཁྱོད་ནི་ངུ་འབོད་རབ་འཇིགས་པར། །ཀྱི་ཧུད་ཟེར་ཞིང་ཆོ་ངེས་འདེབས། །དེ་ཚེ་སྡུག་བསྔལ་ཆེན་པོ་ནི། །ངན་པ་ཐམས་ཅད་མྱོང་བར་འགྱུར། །
en: “ ‘You’ll be terrified at the things you hear As you sob in the horrid Shrieking Hell— Episodes of tremendous torment, Iterations of every ill.

source: སྡིག་པའི་ལས་ནི་མི་བཟད་པ། །ཁྱོད་ལ་དེ་ཡིས་ཅི་ཞིག་བྱས། །
en: “ ‘Unbearable, your wicked deed— Whatever did he do to you?

source: ཆོས་དང་མི་འཐུན་འཇིགས་པ་ཡི། །སྡིག་ལ་ཁྱོད་ཀྱིས་སེམས་གནས་ཏེ། །
en: “ ‘Remember the terrible sin that you, Devoid of Dharma, chose to commit.

source: ཁྱོད་ཀྱིས་སྡིག་པ་ཅི་བྱས་པ། །
en: How could you have done this wicked deed?

source: དོམ་དང་སེང་གེ་དྲན་པར་གྱིས། །
en: Not the bear nor the lion should you forget.

source: བློ་ངན་ཁྱོད་ནི་བསེན་རྣམས་ལ། །ཇི་ལྟར་བྱ་བ་མི་ཤེས་ཏེ། །
en: “ ‘You’ve so little sense, you failed to comprehend How one should act toward a friend.

source: གསོད་པ་གསོད་དང་ཕྲད་པར་འགྱུར། །
en: Through killing, you will meet your murder.

source: འཁོན་པ་འཁོན་དང་ཕྲད་པར་འགྱུར། །
en: By malice, you will meet your foe.

source: འཇིགས་ཆེན་སེང་གེ་ཕྲད་པ་ན། །རིང་དུ་ཁྱོད་ཀྱི་རིམ་གྲོ་བྱས། །
en: “ ‘When you encountered a terrifying lion, The bear offered you his service for the duration.

source: ཁྱོད་ནི་རྦབ་ཏུ་ལྷུང་ལས་བསྲུངས། །དེ་ནི་ཁྱོད་ཀྱིས་ཡོད་མ་བསྲུངས། །
en: He protected you from falling, A favor you did not return.

source: བསེན་འཁུ་འཆིང་བའི་མཆོག་ཡིན་ཞེས། །ཆོས་སྨྲ་རྣམས་ནི་དེ་སྐད་སྟོན། །
en: “ ‘Those who teach the Dharma say, “Betraying a friend is the vilest fetter.”

source: བློ་རུལ་ཁྱོད་ནི་ཤི་བ་ན། །དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར། །
en: So when you die—you of rotten mind— You’ll take rebirth in the hells.’

source: ཚིགས་སུ་བཅད་པ་འདི་རྣམས་ཀྱི་སྡོམ་ནི། ཀྱི་འདུག་དེ་བདེ་ཁྱོད་སྡིག་ཆོས་བློ་འཇིགས་བསེན། དེ་ནས་མི་དེས་དྲང་སྲོང་གི་རྒྱ་གང་དེས་ཐོས་ནས་སྐྱོ་བ་སྐྱེས་ཏེདེ་དྲང་སྲོང་དེ་ཉིད་ཀྱི་ཐད་དུ་རབ་ཏུ་བྱུང་ངོ་། །
en: “Having heard the sage’s rebuke, the man regretted his actions and went forth in the presence of the very same sage.

source: དེའི་ཚེ་ཡང་འདི་བྱས་པ་མི་ཤེས་པ་དང་བྱས་པ་མི་གཟོ་བ་དང་བྱས་པ་ཆུད་གཟོན་པར་འགྱུར་རོ།། །།
en: At that time too, neither did he repay my kindness, nor did he have any sense of gratitude, but rather made a waste of what I did.”

source: སྒུར་ཆུང་ཞེས་བྱ་བ་ནི།
en: The Story of Small Person with a Curving Spine

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་བྲམ་ཟེ་དབུལ་པོ་འཚོ་བ་ཕོངས་པ་སློངས་མོའི་ཟས་ཀྱིས་འཚོ་བ་ཞིག་གནས་པ་ལས་ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: When the Blessed One was in Śrāvastī, there lived a certain poor brahmin who was destitute of means and made his living begging for food. One day his wife became pregnant,

source: དེ་མའི་ལྟོར་ཞུགས་ཕྱིན་ཅད་བྲམ་ཟེ་དེ་ལྷག་པར་ཡང་སློངས་མོ་ཡང་ཆེར་ཡང་མི་རྙེད་པར་གྱུར་ཏོ། །
en: and after she conceived the brahmin did not receive very much in the way of alms.

source: དེ་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་མདོག་ངན་པ་དང་བྱད་ངན་པོ་རིད་ཅིང་སྦེག་ལ་སྒུར་བ་ཞིག་བཙས་ཏེ།
en: After nine or ten months had passed, she gave birth to a child who was gaunt and emaciated and had a poor complexion, an ugly face, and a crooked spine.

source: དེའི་བཙས་སྟོན་ཅི་འབྱོར་ཙམ་ཞིག་བྱས་ནས། ཁྱེའུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: They celebrated his birth with whatever they could scrounge together and asked, “What name should we give this child?”

source: ཁྱེའུ་འདི་ཆུང་ལ་སྒུར་བས་ན་དེའི་ཕྱིར་འདིའི་མིང་སྒུར་ཆུང་ཞེས་གདགས་སོ་ཟེར་རོ། །
en: And they named him, saying, “Since this child is very small, and has a curved spine, his name will be Small Person with a Curving Spine.”

source: དེ་ནས་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared him on milk, yogurt, butter, ghee, and milk solids.

source: དེ་ནས་ཕྱི་ཞིག་ན་སེམས་ཅན་དེའི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་མའི་ནུ་ཞོ་སྐམས་སོ། །
en: One day, this being’s past actions ripened such that his mother’s breast ran dry.

source: དེ་ནས་དེའི་མས་དེ་བ་དང་མ་ཧེའི་འོ་མས་གསོས་པ་དང་དེ་ཡང་ལེགས་པར་མི་འབྱོར་ཏོ། །
en: After that his mother nourished him with cow and buffalo milk, but these too proved scarce.

source: སྲིད་པ་ཐ་མ་པའི་སེམས་ཅན་བར་མ་དོར་འཆི་བ་ནི་གནས་མེད་ཅིང་སྐབས་མེད་དེ།
en: Now it is impossible and out of the question for a being in their final existence to die an untimely death.

source: དེའི་བ་དང་མ་ཧེའི་འོ་མ་རེས་འགའ་ནི་འབྱོར་རེས་འགའ་ནི་མི་འབྱོར་ནས་དེ་ངན་ངོན་ཞིག་གསོས་ཏེ།
en: Thus, they could occasionally obtain cow and buffalo milk, and he did receive some modest nourishment.

source: ཆེར་སྐྱེས་པ་དང་ཕས་དེ་ལ་སྨྲས་པ།
en: When he had grown, his father said to him,

source: བུ་བདག་ཅག་ནི་སློངས་མོས་འཚོ་བ་ཁོ་ནར་ཟད་དེ།
en: “Child, our entire livelihood consists only of begging.

source: ཞིང་རྨོ་བ་ཡང་མེད་ཚོང་བྱ་བ་ཡང་མེད་ཀྱིས་སློངས་མོ་ལ་སོང་ལ་སློངས་མོའི་ཟས་ཀྱིས་འཚོ་བར་གྱིས་ཤིག་ཅེས་བྱས་སོ། །
en: We have neither fields to plow, nor any business to conduct.

source: དེ་ནས་བཀའ་བཞིན་འཚལ་ཞེས་བྱས་ནས་ཁྱེའུ་དེ་སློངས་མོ་ལ་ཞུགས་ནས།
en: So go now and make your living from whatever food you can beg.” “As you wish,” the child replied, and he began to beg.

source: དེས་ཡུན་རིང་དུ་བསྐོར་ཀྱང་སྲོག་གཟུངས་ཅུང་ཟད་ཙམ་ལས་མི་རྙེད་དོ། །
en: But even when he would spend a long time walking all about, he never found more than was enough to barely keep himself alive.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱེའུ་དེ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་དེ་
en: Then at a certain point the young man found faith in the doctrine of the Blessed One,

source: དགེ་སློང་ཞིག་གི་ཐད་དུ་སོང་ནས་སྨྲས་པ།
en: so he approached a monk and asked him,

source: བཙུན་པ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན
en: “Lord, if appropriate, I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: དགེ་སློང་གིས་སྨྲས་པ། ཁྱོད་ཀྱི་ཕ་མ་གསོན་ནམ་དེས་སྨྲས་པ་གསོན་ནོ། །
en: “Are your parents still alive?” asked the monk. “They are,” he replied.

source: དགེ་སློང་གིས་སྨྲས་པ། ཁྱོད་ཀྱིས་ཕ་མ་ལ་བཟླུགས་སམ་བཙུན་པ་མ་བཟླུགས་སོ། །
en: “Have you informed your parents about this?” “I have not, lord.”

source: དགེ་སློང་གིས་སྨྲས་པ། བུ་སངས་རྒྱས་རྣམས་དང་སངས་རྒྱས་ཀྱི་ཉན་ཐོས་རྣམས་ནི་ཕ་མས་མ་གནང་བར་རབ་ཏུ་འབྱིན་པ་མི་མཛད་ཀྱིས།
en: “Young man, the buddhas and their disciples neither lead novices to go forth nor confer full ordination without the parents’ permission,” the monk told him.

source: སོང་ལ་ཕ་མ་གཉིས་ལ་བཟླུགས་ལ་ཕྱིར་ཤོག་ཅིག་དང་དེའི་འོག་ཏུ་ཁྱོད་ཀྱི་སླ་བར་འགྱུར་རོ། །
en: “Go and inform your parents, then come back here. This will make things easier for you later on.”

source: དེ་ནས་ཁྱེའུ་སྒུར་ཆུང་གིས། དགེ་སློང་དེའི་ཚིག་མཉན་ནས་ཕ་མའི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ།
en: So Small Person with a Curving Spine heeded the monk’s advice, approached his parents, and said,

source: ཡབ་ཡུམ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བར་གནང་བར་མཛད་དུ་གསོལ།
en: “Mother, Father, I am asking for your kind permission to go forth in the doctrine of the Blessed One.”

source: དེ་ནས་ཕ་མ་གཉིས་ཀྱིས་བསམས་པ།
en: His parents thought,

source: ད་ལྟ་འདི་ཡང་མཆོག་ཏུ་སྡུག་བསྔལ་ལ།
en: “Until now, his suffering knew no equal.

source: བདག་ཅག་གཉིས་ཀྱང་སྡུག་བསྔལ་ཏེ།
en: The two of us have also suffered so.

source: འདི་ཙམ་ཞིག་ཀྱང་བདེ་བར་གྱུར་ན་ལེགས་ཀྱིས་རབ་ཏུ་བྱུང་ཡང་སླའམ།
en: All it would take to bring him happiness is for him to go forth.

source: འོན་ཀྱང་ཚེ་འདི་དང་ཚེ་ཕྱི་མ་ལ་ཡང་བདེ་བ་འཐོབ་པར་འགྱུར་རོ་སྙམ་ནས་སྨྲས་པ།
en: Moreover, he’ll be able to achieve happiness not just in this life but in the next as well.” With these thoughts in mind, they said,

source: བུ་གནང་གིས་གལ་ཏེ་ཁྱོད་ཀྱིས་ཁྱད་པར་འགའ་ཞིག་ཐོབ་པར་གྱུར་ན་ངེད་གཉིས་ལ་ཡང་སྟོན་ཅིག །
en: “Of course, child. Should you achieve any special attainments, please demonstrate them to us.”

source: དེ་ནས་བཀའ་བཞིན་འཚལ་ཞེས་བྱས་ཏེ།
en: “As you wish,” he replied.

source: ཁྱེའུ་སྒུར་ཆུང་ཕ་མས་གནང་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱིས་ཚལ་དུ་སོང་སྟེ།
en: After receiving permission from his parents, Small Person with a Curving Spine went on to the garden of Prince Jeta.

source: དགེ་སློང་དེའི་ཐད་དུ་ཕྱིན་ནས་སྨྲས་པ།
en: There he approached the monk and told him,

source: བཙུན་པ་བདག་གིས་ཕ་མ་གཉིས་ལ་བཟླུགས་ནས་བདག་ཕ་མ་གཉིས་ཀྱིས་གནང་ལགས་ན། བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, I’ve informed both my parents. Now that my parents have given me their consent to go forth, Lord, if permitted, I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: བདག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པར་འཚལ་ལོ་ཞེས་བྱས་སོ། །
en: In the presence of the Blessed One, I too wish to practice the holy life.”

source: བདག་ཉིད་ཆེན་པོ་དེ་དག་ནི་གཞན་ལ་ཕན་འདོགས་པ་ལ་ཞུགས་པ་ཡིན་ཏེ།
en: Great persons do that which is of benefit to others,

source: དགེ་སློང་དེས་དེ་རབ་ཏུ་ཕྱུང་ནས་བསྙེན་པར་རྫོགས་པར་བྱས་སོ། །
en: so the monk led him to go forth as a novice and conferred on him full ordination.

source: དེ་ནས་དེས་ཞག་གཉིས་སམ་གསུམ་གྱི་བར་དུ་ཁ་ཟས་ཀྱིས་བཤུགས་ནས་སྨྲས་པ།
en: The monk provided him with two or three days’ worth of food, and then instructed him,

source: བུ་རི་དགས་ཀྱིས་རི་དགས་མི་སོས་ཀྱིས་ཁྱོད་ཀྱིས་ཕས་ཕོག་པའི་ཡུལ་རང་གི་སྤྱོད་ཡུལ་བསོད་སྙོམས་ལ་སོང་ཤིག་ཅེས་བསྒོའོ། །
en: “My child, one deer cannot feed another. Go then for alms to your home region, the country frequented by your father.”

source: དེ་ནས་དེས་མཁན་པོའི་ཚིག་མཉན་ཏེ་རེས་འགའ་ནི་བསོད་སྙོམས་ལ་འགྲོའོ། །
en: Heeding the words of his preceptor, he would occasionally go begging for alms.

source: རེས་འགའ་ནི་དགེ་འདུན་གྱི་གྲལ་དུ་ཟན་ཟ་བར་བྱེད་དེ། གལ་ཏེ་དགེ་འདུན་གྱི་གྲལ་དུ་ཟན་ཟ་ན་ནི་དེ་ལ་འདྲིམ་པའི་ཚེ། དེའི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཟས་གང་འདྲིམ་པ་དེ་དེའི་ཐད་དུ་ཕྱིན་པ་དང་ཟས་དང་སྐོམ་ཟད་པར་འགྱུར་རོ། །
en: Sometimes, however, he would also try to eat food by seating himself in the rows of the saṅgha, but as the food was being distributed, his past actions would ripen such that the food and drink would run out just as it was to be distributed to him,

source: ཡང་ན་དེ་དག་ལ་གློ་བུར་གྱི་རྐྱེན་འབྱུང་བར་འགྱུར་རོ། །
en: or else some other intervening complication would arise.

source: དེ་ནས་དེ་དག་ཕྱིར་འོངས་ན་ཡང་དེ་ལས་ཐལ་ནས་འོག་མ་ལ་བྱིན་ཏེ་འདྲིམ་པར་བྱེད་པས།
en: Even when they then returned, he would be passed over, and the food would be distributed to those behind him.

source: དེ་དེ་ན་འདུག་ཀྱང་ཁ་ཅིག་ནི་འཐོབ་ཁ་ཅིག་ནི་མི་འཐོབ་བོ། །
en: Thus, even while seated there in the rows, sometimes he would get food and other times he would not.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་ཚོར་ནས་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཏོ། །
en: When the monks heard about this, they asked the Blessed One about it.

source: དགེ་སློང་དག་དགེ་སློང་འོག་ན་འདུག་པའི་ནན་ཏན་དུ་བྱ་བའི་ཆོས་བཅའ་བར་བྱས་ཏེ།
en: “Monks, let there be a rule established for monks sitting behind.

source: འོག་ན་འདུག་པའི་དགེ་སློང་གིས་ཇི་སྲིད་དུ་གོང་ན་འདུག་པས་མ་བླངས་ཀྱི་བར་དུ་བཟའ་བ་དང་བཅའ་བ་བླང་བར་མི་བྱའོ། །
en: Those sitting behind should not take their food until those in front of them have taken theirs.

source: ཡང་ན་ཐབས་ཅི་ཞིག་ལྟར་ཐལ་ཏེ་བླངས་པར་གྱུར་ན་ཡང་དེས་མ་ཐོབ་ཀྱི་བར་དུ་བསྒྲུབ་པ་མི་གཏོང་བར་བྱའོ། །
en: If for some reason another person is passed over, they should not eat until that person has received a share.

source: དེ་སྟེ་སྦྱིན་དུ་གཞུག་མ་ནུས་ན་བདག་གི་ཟས་ལས་དེ་ལ་ཕྱེད་སྦྱིན་པར་བྱའོ། །
en: If, moreover, one person was not able to receive everything, the others should divide their food with that person.

source: ཕྱེད་ནི་བདག་གིས་བཟའ་བར་བྱ་སྟེ། དེ་ལྟར་བྱིན་ན་ནི་ལེགས་མ་བྱིན་ན་ཉེས་པ་དང་བཅས་པར་འགྱུར་རོ། །
en: To do so is good. To do otherwise is an infraction.

source: གལ་ཏེ་བསོད་སྙོམས་ལ་འགྲོ་ན་ནི་དེས་བསོད་སྙོམས་བཀའ་འཁོར་དུ་རྙེད་པར་འགྱུར་རོ། །
en: Those who commit such an infraction will take alms in service of others when they go for all alms.”

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གིས། བཅོམ་ལྡན་འདས་ཀྱི་དྲི་གཙང་ཁང་ཕྱག་དར་བྱས་ནས་དེས་དེའི་ཉིན་པར་བཟའ་བ་དང་བཅའ་བ་བཟང་པོ་རྙེད་དོ། །
en: Then one day Venerable Small Person with a Curving Spine swept the Blessed One’s fragrant chamber, and that day he received good food and drink.

source: དེ་བཞིན་དུ་ཞག་གཉིས་དང་ཞག་གསུམ་གྱི་བར་དུ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་དྲི་གཙང་ཁང་ཕྱག་དར་བྱས་ན་ཡང་། དེའི་ཉིན་པར་བཟའ་བ་དང་བཅའ་བ་བཟང་པོ་རྙེད་ནས།
en: He also received good food and drink as he continued sweeping the Blessed One’s fragrant chamber for the next two or three days.

source: དེའི་ལུས་མཐུ་དང་ལྡན་པ་དང་ལས་སུ་རུང་བ་དང་སྤོང་ནུས་པར་གྱུར་ཏེ།
en: As a result, his body became strong, resilient, and capable.

source: དེས་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: He cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: ཙན་དན་སྦངས་པ་ལྟ་བུ་བསིལ་བར་གྱུར་པ།
en: He became cool like wet sandalwood.

source: སྲིད་པའི་རྙེད་པ་དང་། ཆགས་པ་དང་། བཀུར་སྟི་ལ་
en: He had no regard for worldly profit, passion, or acclaim.

source: རྒྱབ་ཀྱིས་ཕྱོགས་པ། དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: He became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: དེས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ཀྱང་དེའི་སྔོན་གྱི་ལས་མངོན་དུ་སྨིན་ནས། དེའི་ཉིན་པར་དགེ་སློང་གཞན་ཞིག་གིས། བཅོམ་ལྡན་འདས་ཀྱི་དྲི་གཙང་ཁང་ཕྱག་དར་བྱས་སོ། །
en: When he achieved arhatship, his past actions ripened such that on that day a different monk swept the Blessed One’s fragrant chamber.

source: དེ་ནས་དེ་ཕྱགས་མ་ཐོགས་ཏེ་སོང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་དྲི་གཙང་ཁང་ཕྱག་དར་བྱའོ་སྙམ་པ་དང་།
en: He was walking along carrying a broom, thinking, “I’m off to sweep the Blessed One’s fragrant chamber,”

source: དེས་དགེ་སློང་གཞན་ཞིག་གིས་ཕྱག་དར་བྱས་པར་མཐོང་ནས་དེའི་བློ་སྐྱེས་པ། གལ་ཏེ་ན་དེང་བདག་སྨྱུང་བར་འོང་སྲིད་དོ་སྙམ་ནས་
en: and when he saw that another monk had already swept it, he thought, “I may now find myself going hungry.”

source: སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གྱོན་ཏེ་ལྷུང་བཟེད་ཐོགས་ནས་མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་སོང་ངོ་། །
en: So in the morning he donned his lower garment and Dharma robes, and, carrying his alms bowl, he went for alms in Śrāvastī.

source: དེ་དེར་སོང་བ་ལས་ཅི་ཡང་མ་རྙེད་དེ། དེ་དེའི་ཉིན་པར་སྨྱུང་བར་འདུག་གོ། །
en: But even though he did, he did not receive anything, and that day he went hungry.

source: དེ་ནས་ཕྱི་དེ་ཉིན་པར་ཡང་དགེ་སློང་གཞན་ཞིག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་དྲི་གཙང་ཁང་ཕྱག་དར་བྱས་སོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ཕྱགས་མ་ཐོགས་ཏེ་སོང་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དྲི་གཙང་ཁང་ཕྱག་དར་བྱའོ་སྙམ་པ་དང་།
en: On the following day as well Venerable Small Person with a Curving Spine was walking along carrying a broom, thinking, “I’m off to sweep the Blessed One’s fragrant chamber,”

source: དགེ་སློང་གཞན་ཞིག་གིས་ཕྱག་དར་བྱས་པར་དེས་མཐོང་ནས།
en: when he saw that another monk had already swept it.

source: དེའི་བློ་སྐྱེས་པ་བདག་དེང་དུ་ལན་གཉིས་སྨྱུང་བར་འོང་སྲིད་དོ་སྙམ་ནས་རང་གི་གནས་ཁང་དུ་སོང་ངོ་། །
en: Thinking, “Today I may go hungry a second time,” he returned to his hut.

source: དེ་ནས་དེ་དེ་ན་འདུག་པ་ལས་ཁྱིམ་བདག་ཅིག་གིས་བཅོམ་ལྡན་འདས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཁྱིམ་དུ་བཤོས་ལ་སྤྱན་དྲངས་སོ་ཞེས་ཐོས་ནས།
en: There he heard that a householder had invited the Blessed One and the rest of the saṅgha of monks to take their food at his house, and he thought,

source: དེའི་བློ་སྐྱེས་པ་བདག་ད་ཡང་བསོད་སྙོམས་ལ་འགྲོ་ཅི་དགོས་ཀྱིས་ཁྱིམ་གང་དུ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བཤོས་གསོལ་བ་དེ་ཁོ་ནར་སོང་ལ་ཟན་བཟའོ་སྙམ་ནས་
en: “What need is there for me to go for alms? Now I can go and take my food at the same house where the Blessed One and the rest of the saṅgha of monks are going to eat.”

source: གནས་ཁང་དུ་ཞུགས་ཏེ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་བསམ་གཏན་ལྷུར་བྱེད་ཅིང་འདུག་གོ། །
en: So he sat down in a cross-legged position and began to meditate.

source: དེ་ནས་ཁྱིམ་བདག་དེ་ལ་དོན་ཆེད་ཆེན་པོ་ཞིག་བྱུང་ནས་དེས་སྔ་རབ་ཏུ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་ལ་བསྐུལ་ནས།
en: In the meantime, some important matters came up for the householder, so he invited the Blessed One and the rest of the saṅgha of monks to take the midday meal at his house a bit early,

source: དེས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ནས་སོང་ངོ་། །
en: and with his own hand he contented them with many good, wholesome foods.

source: བཅོམ་ལྡན་འདས་ནི་ཁྱིམ་དེའི་མི་རྣམས་ལ་ཆོས་ཀྱི་གཏམ་མཛད་ནས་གཙུག་ལག་ཁང་དུ་ཆས་ཏེ་གཤེགས་སོ། །
en: Afterward, the Blessed One gave a Dharma teaching for the people of the house and returned to the monastery.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གིས་དྲོ་ལ་བབ་པར་ཤེས་ནས་ལངས་ཏེ་
en: Venerable Small Person with a Curving Spine noticed that the day had become warm, so

source: ཆོས་གོས་བགོས་ནས་ལྷུང་བཟེད་ཐོགས་ཏེ་སོང་བ་ལས།
en: he donned his lower garment and Dharma robes, and set out carrying his alms bowl.

source: བཅོམ་ལྡན་འདས་ནི་ལམ་ལོགས་ཤིག་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་གཤེགས་སོ། །
en: The Blessed One, traveling on one side of the road, entered the garden of Prince Jeta,

source: དེ་ནི་ལམ་ལོགས་ཤིག་ནས་ཁྱིམ་བདག་གི་ཁྱིམ་དེར་སོང་ངོ་། །
en: and Venerable Small Person with a Curving Spine, traveling on the other side of the road, went to the householder’s home.

source: དེ་ནས་དེ་དེར་སོང་ནས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བཤོས་གསོལ་ཏེ་གཤེགས་པར་ཤེས་སོ། །
en: When he arrived, he realized that the Blessed One and the rest of the saṅgha of monks had already taken their food and departed.

source: དེ་ནས་དེ་དེའི་ཉིན་བར་དུ་ལན་གཉིས་སུ་སྨྱུང་བར་གྱུར་ཏོ། །
en: So it was that he went hungry a second day.

source: དེའི་ཕྱི་དེ་ཉིན་པར་ཡང་དགེ་སློང་གཞན་ཞིག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་དྲི་གཙང་ཁང་ཕྱག་དར་བྱས་སོ། །
en: The following day another monk swept the Blessed One’s fragrant chamber.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ཕྱགས་མ་ཐོགས་ཏེ་སོང་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དྲི་གཙང་ཁང་ཕྱག་དར་བྱའོ་སྙམ་པ་དང་།
en: Venerable Small Person with a Curving Spine was walking along carrying a broom, thinking, “I’m off to sweep the Blessed One’s fragrant chamber,”

source: དེས་དགེ་སློང་གཞན་ཞིག་གིས་ཕྱགས་པར་མཐོང་ངོ་། །
en: when he saw that another monk had already swept it.

source: མཐོང་ནས་ཀྱང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: At that the thought occurred to him,

source: བདག་དེང་དུ་ལན་གསུམ་སྨྱུང་བར་འོང་སྲིད་དོ་སྙམ་ནས་གནས་ཁང་དུ་སོང་ངོ་། །
en: “Today I may go hungry a third time,” and he returned to his hut.

source: དེ་དེར་སོང་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ལན་གཉིས་སྨྱུང་བར་གྱུར་ཏོ་ཞེས་ཐོས་སོ། །
en: After he was home, word reached Venerable Ānanda that Venerable Small Person with a Curving Spine had gone hungry for two days already.

source: ཐོས་ནས་ཀྱང་དེས་དེའི་དོན་དུ་སྦྱིན་བདག་ཅིག་ལ་བསྐུལ་ནས་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ།
en: Hearing this, in concern for him he got in touch with one of their patrons, then came to Venerable Small Person with a Curving Spine and said,

source: ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ཁྱོད་དེང་ཁྱིམ་བདག་ཆེ་གེ་མོ་ཞིག་གི་ཁྱིམ་དུ་སོང་ལ་ཟན་ཟོ་ཤིག་ཅེས་བྱས་ནས
en: “Venerable Small Person with a Curving Spine, today you should go and eat at the home of such-and-such a householder.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ཉིད་ནི་ཆོས་གོས་བགོས་ཏེ་ལྷུང་བཟེད་ཐོགས་ནས་མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་སོང་ངོ་། །
en: Thereupon Venerable Ānanda donned his lower garment and Dharma robes, and, carrying his alms bowl, went for alms in Śrāvastī.

source: ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ཡང་ཐག་གི་ཟད་ཙམ་གྱི་བར་དུ་སྡོད་སྡོད་ནས་སྔ་དྲོ་ཆོས་གོས་བགོས་ཏེ་ལྷུང་བཟེད་ཐོགས་ནས་ཁྱིམ་བདག་དེའི་ཁྱིམ་དུ་སོང་ན། དེའི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཁྱིམ་བདག་དེ་ལ་དོན་ཆེད་ཆེན་པོ་ཞིག་བྱུང་ནས་དེས་བརྗེད་དེ་ཁྱིམ་མི་སུ་ལ་ཡང་མ་བྱས་པར་གྲོང་གཞན་ཞིག་ཏུ་སོང་ངོ་། །
en: But, after having waited such a long time, when Venerable Small Person with a Curving Spine donned his lower garment and Dharma robes, and, carrying his alms bowl, went to the home of that householder, his past actions ripened in such a way that some important matters came up for the householder, who in his distraction left for another village without mentioning anything to the people of his house.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གིས་དེར་སོང་ཡང་མ་རྙེད་ནས་དེའི་ཉིན་བར་དུ་ལན་གསུམ་སྨྱུང་བར་གྱུར་ཏོ། །
en: Having gone there and not received any food, Venerable Small One with a Curving Spine went hungry a third day.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་དེའི་ཉིན་བར་དུ་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ལན་གསུམ་དུ་སྨྱུང་བར་གྱུར་ཏོ་ཞེས་ཐོས་ནས་དེས་བསམས་པ།
en: Word reached Venerable Ānanda that Venerable Small Person with a Curving Spine had now gone hungry for three days, and he thought,

source: བདག་ཉིད་ཀྱིས་བསོད་སྙོམས་བླངས་ལ་འདི་ལ་བསྟབས་པར་བྱའོ་སྙམ་ནས
en: “I myself will bring alms for him.”

source: ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: He went to Venerable Small Person with a Curving Spine and said,

source: ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ཁྱོད་སྙིང་མ་ཆུང་ཤིག་དང་།
en: “Don’t worry, Venerable Small Person with a Curving Spine!

source: བདག་གིས་སང་ཁྱོད་ལ་ཁ་ཟས་བསྟབས་སོ་ཞེས་སྨྲས་ནས། དེ་གནས་ཁང་དུ་སོང་ངོ་། །
en: Tomorrow I shall have food for you,” and he returned to his hut.

source: དེ་ནས་དེ་ཕྱི་དེ་ཉིན་པར་ལྷུང་བཟེད་གཉིས་ཐོགས་ཏེ་མཉན་དུ་ཡོད་པར་སོང་ནས།
en: The next day, carrying two alms bowls, he set out for Śrāvastī.

source: དེས་བསོད་སྙོམས་ལྷུང་བཟེད་དོ་བསླངས་ཏེ་གཅིག་ནི་བདག་ཉིད་ཀྱིས་ཟོས་སོ། །
en: After begging alms there, he ate some himself.

source: གཅིག་ནི་དེའི་དོན་དུ་ཁྱེར་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཆས་ཏེ་སོང་བ་ལས་དེའི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ལམ་དུ་ལས་ལས་སྐྱེས་པའི་ཁྱི་དག་བྱུང་སྟེདེ་དག་གིས་ཁ་ཟས་དེ་ཕྲོགས་ནས་ཟོས་སོ། །
en: Intending the rest for Venerable Small Person with a Curving Spine, he was carrying them to the garden of Prince Jeta when Venerable Small Person with a Curving Spine’s past actions ripened such that dogs appeared along the way, and they stole the food and ate it.

source: དེ་ནས་དེས་བསམས་པ་ད་བདག་ཕྱིར་མཉན་དུ་ཡོད་པར་སོང་ན་ནི་དྲོ་ཡོལ་བར་འགྱུར་རོ་སྙམ་སྟེ་
en: Venerable Ānanda thought, “By the time I make it back to Śrāvastī, it will be past noon.”

source: གཙུག་ལག་ཁང་དུ་སོང་ནས། ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་དེའི་ཉིན་བར་དུ་ལན་བཞི་སྨྱུང་བར་གྱུར་ཏོ། །
en: So he returned to the monastery, and on that day Venerable Small Person with a Curving Spine went hungry a fourth time.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ལན་བཞི་སྨྱུང་བར་གྱུར་ཏོ་ཞེས་ཐོས་ནས་དེས་བསམས་པ།
en: Then word reached Venerable Maudgalyāyana that Venerable Small Person with a Curving Spine had now gone hungry for four days, and he thought,

source: བདག་གིས་སང་ནང་པར་དེ་ལ་ཁ་ཟས་བསྟབས་པར་བྱའོ་སྙམ་ནས་གནས་ཁང་དུ་སོང་ངོ་། །
en: “Tomorrow I shall bring him food,” and he returned to his hut.

source: དེ་ནས་དེ་ཕྱི་དེ་ཉིན་པར་ལྷུང་བཟེད་གཉིས་ཐོགས་ཏེ། མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་སོང་ནས་དེས་བསོད་སྙོམས་ལྷུང་བཟེད་དོ་བསླངས་ཏེ་གཅིག་ནི་བདག་ཉིད་ཀྱིས་ཟོས་སོ། །
en: The next day, carrying two alms bowls, he went for alms in Śrāvastī. After begging alms there, he ate some himself.

source: གཅིག་ནི་དེའི་དོན་དུ་ཁྱེར་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཆས་ཏེ་སོང་བ་ལས། དེའི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ལམ་དུ་ལས་ལས་སྐྱེས་པའི་བྱ་རོག་དག་བྱུང་ནསདེ་དག་གིས་ཁ་ཟས་དེ་ཕྲོགས་ནས་ཟོས་སོ། །
en: Intending the rest for Venerable Small Person with a Curving Spine, he was carrying them to the garden of Prince Jeta when Venerable Small Person with a Curving Spine’s past actions ripened such that crows appeared along the way, and they stole the food and ate it.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་བསམས་པ།
en: Then Venerable Maudgalyāyana thought,

source: ད་བདག་མཉན་དུ་ཡོད་པར་སོང་ན་ནི་དྲོ་ཡོལ་བར་འགྱུར་རོ་སྙམ་སྟེ་
en: “By the time I make it back to Śrāvastī, it will be past noon.”

source: གཙུག་ལག་ཁང་དུ་སོང་ནས། ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་དེའི་ཉིན་བར་དུ་ལན་ལྔ་སྨྱུང་བར་གྱུར་ཏོ། །
en: So he returned to the monastery, and on that day Venerable Small One with a Curving Spine went hungry a fifth time.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ལན་ལྔ་སྨྱུང་བར་གྱུར་ཏོ་ཞེས་ཐོས་ནས་དེས་བསམས་པ།
en: Then word reached Venerable Śāriputra that Venerable Small Person with a Curving Spine had now gone without food for five days, and he thought,

source: བདག་གིས་སང་ནང་པར་དེ་ལ་ཁ་ཟས་བསྟབས་པར་བྱའོ་སྙམ་ནས་
en: “Tomorrow I shall bring him food.”

source: ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ།
en: He went to Venerable Small One with a Curving Spine and said,
